function Post() {
  return (
    <div className="flex flex-col items-center justify-center w-full py-20">
      <div>
        <div className="pb-10">
          <span className="font-bold text-8xl">awwwards my app</span>
        </div>
        <div className="flex items-center pb-20">
          <div className="flex justify-around w-full">
            <div className="flex items-center justify-center gap-4 text-2xl font-bold">
              <img
                className="w-8 h-8 rounded-full"
                src={`https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/f7fa91bd-bd76-4274-5220-e796e1565100/avatar`}
                alt="avatar"
              />
              <span>baek-si-hyun</span>
            </div>
            <span className="text-2xl font-bold">2023-06-08</span>
          </div>
        </div>
      </div>

      <div className="flex flex-col w-[1100px] gap-4">
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/9a3c9ee7-1f22-43ad-e386-35d840d5e700/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4 py-4">
          <span className="text-4xl font-bold">사용 기술 스택</span>
          <div className="flex gap-1">
            <span>NextJS</span>
            <span>NextJS</span>
            <span>NextJS</span>
            <span>NextJS</span>
            <span>NextJS</span>
            <span>NextJS</span>
          </div>
        </div>
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/5a18aaac-83d3-4489-5993-3fd9e09a5100/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4">
          <span className="text-4xl font-bold">프로젝트 설명</span>
          <span>
            현대 사회에서 인공지능(AI)은 우리의 삶을 근본적으로 변화시키고
            있습니다. AI 기술은 빠르게 발전하며, 다양한 산업 분야에서 혁신적인
            변화를 가져오고 있습니다. 이 글에서는 인공지능의 현재와 미래에 대해
            논의하고, 우리의 삶에 미치는 영향을 살펴보겠습니다. 인공지능의 현재
            상황 인공지능 기술은 이미 우리 주변에 널리 적용되고 있습니다.
            스마트폰 음성 비서, 자율 주행 자동차, 의료 진단 및 로봇 등 다양한
            분야에서 AI 기술이 사용되고 있습니다. 머신러닝과 딥러닝 알고리즘의
            발전은 대규모 데이터를 분석하고 예측하는 능력을 향상시켰습니다.
            이로써 기업은 효율성을 높이고 소비자에게 더 나은 서비스를 제공할 수
            있게 되었습니다. 인공지능의 미래 전망 인공지능의 미래는 매우
            흥미로운 것으로 예측됩니다. 자율 주행 차량은 도로 안전과 교통
            효율성을 향상시킬 것으로 기대됩니다. 의료 분야에서는 AI가 진단 및
            치료 방법을 개선하고 환자 데이터를 분석하여 개별 맞춤형 치료를
            제공할 것입니다. 또한, 교육, 금융, 엔터테인먼트 분야에서도 AI는
            혁신적인 서비스와 경험을 제공할 것으로 전망됩니다. 인공지능의 도전과
            과제 인공지능의 발전은 동시에 도전과 과제도 가져왔습니다. 개인 정보
            보호와 데이터 무단 사용에 대한 우려, 일자리 변화 및 인간과 인공지능
            간의 윤리적 문제가 있습니다. 이러한 도전에 대처하려면 정책 제정과
            교육이 필요합니다. 결론적으로, 인공지능은 우리의 삶을 긍정적으로
            변화시키고 있지만, 그에 따른 도전과 과제도 존재합니다. 우리는 적절한
            규제와 윤리적 지침을 준수하면서 인공지능 기술을 발전시키고 활용해야
            합니다. 이를 통해 미래에는 보다 스마트하고 지능적인 사회를 구축할 수
            있을 것입니다.
          </span>
        </div>
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/782af772-bca9-407b-c5ec-fd02980f4000/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4">
          <span className="text-4xl font-bold">
            프로젝트 설명 (넣고 싶으면)
          </span>
          <span>
            현대 사회에서 인공지능(AI)은 우리의 삶을 근본적으로 변화시키고
            있습니다. AI 기술은 빠르게 발전하며, 다양한 산업 분야에서 혁신적인
            변화를 가져오고 있습니다. 이 글에서는 인공지능의 현재와 미래에 대해
            논의하고, 우리의 삶에 미치는 영향을 살펴보겠습니다. 인공지능의 현재
            상황 인공지능 기술은 이미 우리 주변에 널리 적용되고 있습니다.
            스마트폰 음성 비서, 자율 주행 자동차, 의료 진단 및 로봇 등 다양한
            분야에서 AI 기술이 사용되고 있습니다. 머신러닝과 딥러닝 알고리즘의
            발전은 대규모 데이터를 분석하고 예측하는 능력을 향상시켰습니다.
            이로써 기업은 효율성을 높이고 소비자에게 더 나은 서비스를 제공할 수
            있게 되었습니다. 인공지능의 미래 전망 인공지능의 미래는 매우
            흥미로운 것으로 예측됩니다. 자율 주행 차량은 도로 안전과 교통
            효율성을 향상시킬 것으로 기대됩니다. 의료 분야에서는 AI가 진단 및
            치료 방법을 개선하고 환자 데이터를 분석하여 개별 맞춤형 치료를
            제공할 것입니다. 또한, 교육, 금융, 엔터테인먼트 분야에서도 AI는
            혁신적인 서비스와 경험을 제공할 것으로 전망됩니다. 인공지능의 도전과
            과제 인공지능의 발전은 동시에 도전과 과제도 가져왔습니다. 개인 정보
            보호와 데이터 무단 사용에 대한 우려, 일자리 변화 및 인간과 인공지능
            간의 윤리적 문제가 있습니다. 이러한 도전에 대처하려면 정책 제정과
            교육이 필요합니다. 결론적으로, 인공지능은 우리의 삶을 긍정적으로
            변화시키고 있지만, 그에 따른 도전과 과제도 존재합니다. 우리는 적절한
            규제와 윤리적 지침을 준수하면서 인공지능 기술을 발전시키고 활용해야
            합니다. 이를 통해 미래에는 보다 스마트하고 지능적인 사회를 구축할 수
            있을 것입니다.
          </span>
        </div>
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/37239698-4c13-4cf2-f28f-bc58aa85c200/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4">
          <span className="text-4xl font-bold">
            프로젝트 설명 (넣고 싶으면)
          </span>
          <span>
            현대 사회에서 인공지능(AI)은 우리의 삶을 근본적으로 변화시키고
            있습니다. AI 기술은 빠르게 발전하며, 다양한 산업 분야에서 혁신적인
            변화를 가져오고 있습니다. 이 글에서는 인공지능의 현재와 미래에 대해
            논의하고, 우리의 삶에 미치는 영향을 살펴보겠습니다. 인공지능의 현재
            상황 인공지능 기술은 이미 우리 주변에 널리 적용되고 있습니다.
            스마트폰 음성 비서, 자율 주행 자동차, 의료 진단 및 로봇 등 다양한
            분야에서 AI 기술이 사용되고 있습니다. 머신러닝과 딥러닝 알고리즘의
            발전은 대규모 데이터를 분석하고 예측하는 능력을 향상시켰습니다.
            이로써 기업은 효율성을 높이고 소비자에게 더 나은 서비스를 제공할 수
            있게 되었습니다. 인공지능의 미래 전망 인공지능의 미래는 매우
            흥미로운 것으로 예측됩니다. 자율 주행 차량은 도로 안전과 교통
            효율성을 향상시킬 것으로 기대됩니다. 의료 분야에서는 AI가 진단 및
            치료 방법을 개선하고 환자 데이터를 분석하여 개별 맞춤형 치료를
            제공할 것입니다. 또한, 교육, 금융, 엔터테인먼트 분야에서도 AI는
            혁신적인 서비스와 경험을 제공할 것으로 전망됩니다. 인공지능의 도전과
            과제 인공지능의 발전은 동시에 도전과 과제도 가져왔습니다. 개인 정보
            보호와 데이터 무단 사용에 대한 우려, 일자리 변화 및 인간과 인공지능
            간의 윤리적 문제가 있습니다. 이러한 도전에 대처하려면 정책 제정과
            교육이 필요합니다. 결론적으로, 인공지능은 우리의 삶을 긍정적으로
            변화시키고 있지만, 그에 따른 도전과 과제도 존재합니다. 우리는 적절한
            규제와 윤리적 지침을 준수하면서 인공지능 기술을 발전시키고 활용해야
            합니다. 이를 통해 미래에는 보다 스마트하고 지능적인 사회를 구축할 수
            있을 것입니다.
          </span>
        </div>
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/4b52eb81-55ec-40ad-ae8c-96454a403c00/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4">
          <span className="text-4xl font-bold">
            프로젝트 설명 (넣고 싶으면)
          </span>
          <span>
            현대 사회에서 인공지능(AI)은 우리의 삶을 근본적으로 변화시키고
            있습니다. AI 기술은 빠르게 발전하며, 다양한 산업 분야에서 혁신적인
            변화를 가져오고 있습니다. 이 글에서는 인공지능의 현재와 미래에 대해
            논의하고, 우리의 삶에 미치는 영향을 살펴보겠습니다. 인공지능의 현재
            상황 인공지능 기술은 이미 우리 주변에 널리 적용되고 있습니다.
            스마트폰 음성 비서, 자율 주행 자동차, 의료 진단 및 로봇 등 다양한
            분야에서 AI 기술이 사용되고 있습니다. 머신러닝과 딥러닝 알고리즘의
            발전은 대규모 데이터를 분석하고 예측하는 능력을 향상시켰습니다.
            이로써 기업은 효율성을 높이고 소비자에게 더 나은 서비스를 제공할 수
            있게 되었습니다. 인공지능의 미래 전망 인공지능의 미래는 매우
            흥미로운 것으로 예측됩니다. 자율 주행 차량은 도로 안전과 교통
            효율성을 향상시킬 것으로 기대됩니다. 의료 분야에서는 AI가 진단 및
            치료 방법을 개선하고 환자 데이터를 분석하여 개별 맞춤형 치료를
            제공할 것입니다. 또한, 교육, 금융, 엔터테인먼트 분야에서도 AI는
            혁신적인 서비스와 경험을 제공할 것으로 전망됩니다. 인공지능의 도전과
            과제 인공지능의 발전은 동시에 도전과 과제도 가져왔습니다. 개인 정보
            보호와 데이터 무단 사용에 대한 우려, 일자리 변화 및 인간과 인공지능
            간의 윤리적 문제가 있습니다. 이러한 도전에 대처하려면 정책 제정과
            교육이 필요합니다. 결론적으로, 인공지능은 우리의 삶을 긍정적으로
            변화시키고 있지만, 그에 따른 도전과 과제도 존재합니다. 우리는 적절한
            규제와 윤리적 지침을 준수하면서 인공지능 기술을 발전시키고 활용해야
            합니다. 이를 통해 미래에는 보다 스마트하고 지능적인 사회를 구축할 수
            있을 것입니다.
          </span>
        </div>
        <div>
          <img
            src="https://imagedelivery.net/4aEUbX05h6IovGOQjgkfSw/00d3b975-1962-4945-23f7-c7e9002d2a00/public"
            alt="default"
            className="object-cover"
          />
        </div>
        <div className="flex flex-col gap-4">
          <span className="text-4xl font-bold">
            프로젝트 설명 (넣고 싶으면)
          </span>
          <span>
            현대 사회에서 인공지능(AI)은 우리의 삶을 근본적으로 변화시키고
            있습니다. AI 기술은 빠르게 발전하며, 다양한 산업 분야에서 혁신적인
            변화를 가져오고 있습니다. 이 글에서는 인공지능의 현재와 미래에 대해
            논의하고, 우리의 삶에 미치는 영향을 살펴보겠습니다. 인공지능의 현재
            상황 인공지능 기술은 이미 우리 주변에 널리 적용되고 있습니다.
            스마트폰 음성 비서, 자율 주행 자동차, 의료 진단 및 로봇 등 다양한
            분야에서 AI 기술이 사용되고 있습니다. 머신러닝과 딥러닝 알고리즘의
            발전은 대규모 데이터를 분석하고 예측하는 능력을 향상시켰습니다.
            이로써 기업은 효율성을 높이고 소비자에게 더 나은 서비스를 제공할 수
            있게 되었습니다. 인공지능의 미래 전망 인공지능의 미래는 매우
            흥미로운 것으로 예측됩니다. 자율 주행 차량은 도로 안전과 교통
            효율성을 향상시킬 것으로 기대됩니다. 의료 분야에서는 AI가 진단 및
            치료 방법을 개선하고 환자 데이터를 분석하여 개별 맞춤형 치료를
            제공할 것입니다. 또한, 교육, 금융, 엔터테인먼트 분야에서도 AI는
            혁신적인 서비스와 경험을 제공할 것으로 전망됩니다. 인공지능의 도전과
            과제 인공지능의 발전은 동시에 도전과 과제도 가져왔습니다. 개인 정보
            보호와 데이터 무단 사용에 대한 우려, 일자리 변화 및 인간과 인공지능
            간의 윤리적 문제가 있습니다. 이러한 도전에 대처하려면 정책 제정과
            교육이 필요합니다. 결론적으로, 인공지능은 우리의 삶을 긍정적으로
            변화시키고 있지만, 그에 따른 도전과 과제도 존재합니다. 우리는 적절한
            규제와 윤리적 지침을 준수하면서 인공지능 기술을 발전시키고 활용해야
            합니다. 이를 통해 미래에는 보다 스마트하고 지능적인 사회를 구축할 수
            있을 것입니다.
          </span>
        </div>
      </div>
    </div>
  );
}
export default Post;
