import { createSlice } from "@reduxjs/toolkit";

const boardsSlice = createSlice({
  name: "boardsSlice",
  initialState: {
    boards: [
      {
        title: "프론트엔드",
        id: 0,
        todos: [
          { id: 0, title: "보드1", manager:"백시현" , priority: "low", start: "09/21/2023", end: "09/21/2023", description:"여행은 우리 삶에서 가장 흥미로운 경험 중 하나입니다. 새로운 장소를 발견하고 다른 문화를 체험하며 우리 자신을 더 깊게 이해할 수 있는 기회를 제공합니다. 여행은 모험이며 배움의 과정이며, 때로는 도전과 역경을 겪는 것일 수도 있습니다. 그러나 그런 모든 어려움과 불편함도 가치가 있습니다. 여행의 핵심은 탐험과 발견입니다. 우리는 새로운 장소에서 미지의 풍경을 감상하고, 현지 음식을 맛보며, 다른 언어와 문화를 이해하려 노력합니다. 이러한 경험은 우리를 더 열린 사고로 만들어 주며, 세계가 얼마나 다양하고 아름다운지를 보여줍니다. 여행은 또한 새로운 인연을 만들고 친구를 사귈 수 있는 기회를 제공합니다. 다른 여행객이나 현지 주민과 소통하며 새로운 관점을 얻을 수 있습니다. 이러한 인연은 종종 우리의 삶에 긍정적인 영향을 미치며, 우정과 연결을 증진시킵니다."},
          { id: 1, title: "보드2", manager:"박해찬" , priority: "mid", start: "09/21/2023", end: "09/30/2023", description:"여행은 또한 환경에 대한 인식을 높이는 기회를 제공합니다. 지구상의 아름다운 자연 경치를 감상하면서 환경 보호의 중요성을 깨닫게 됩니다. 지속 가능한 여행 방식을 채택하고 지구를 보호하는 역할을 하면서 우리는 미래 세대에 더 나은 환경을 남길 수 있습니다."},
          { id: 2, title: "보드3", manager:"최송윤" , priority: "high", start: "10/21/2023", end: "10/30/2023", description:"결국, 여행은 우리 삶을 더 풍요롭고 흥미로운 것으로 만들어 주는 특별한 경험입니다. 우리는 여행을 통해 자신과 세계를 더 깊게 이해하고, 새로운 것을 탐험하며, 인생을 더 풍요롭게 만들 수 있습니다. 그러니 언제라도 여행을 떠나보고, 세계의 아름다움을 발견해보는 것을 권장합니다."},
          { id: 3, title: "보드4", manager:"최송윤" , priority: "mid", start: "10/21/2023", end: "10/30/2023", description:"무한한 우주는 우리의 무한한 상상력과 맞닿아 있습니다. 우주는 끝없이 넓고 신비로운 곳으로, 인류의 탐구 대상 중 하나로 남아 있습니다. 수천 년 동안, 인간은 별들과 행성, 은하와 우주의 기원에 대한 이야기를 나누어 왔습니다. 이러한 탐구는 과학, 철학, 예술, 그리고 종교의 영역에 걸쳐 이루어져 왔습니다.우주에 대한 지식은 우리의 기술적 발전에도 큰 영향을 미치고 있습니다. 인공위성은 우주를 탐사하고 지구의 통신을 개선하는 데 사용되며, 우주 비행은 새로운 기술과 발견을 이끌어내고 있습니다. 동시에, 우주는 우리의 지구 환경과 지속 가능성에 대한 고민을 불러일으키고 있습니다. 지구 밖의 자원을 개발하면서 어떤 윤리적 고려가 필요한지에 대한 논의가 계속되고 있습니다."},
          { id: 4, title: "보드5", manager:"qortlgus" , priority: "mid", start: "10/21/2023", end: "10/30/2023", description:"우리는 우주와 지구 사이의 관계를 더 잘 이해하기 위해 지속적으로 연구하고 있으며, 더 많은 비밀을 풀어가고 있습니다. 우주는 끝없는 탐구의 대상이며, 우리의 이해력과 호기심은 계속해서 확장되고 있습니다. 우리는 우주를 둘러싼 신비로움과 복잡성을 더 깊이 이해하고, 그로부터 얻는 통찰력을 활용하여 미래를 준비하는 여정을 계속하고 있습니다."},
        ],
      },
      {
        title: "백엔드",
        id: 1,
        todos: [
          { id: 5, title: "보드6", manager:"백시현" , priority: "mid", start: "09/21/2023", end: "09/21/2023", description:"물의 흐름은 인생의 여정과 닮아 있다. 어떤 물은 산에서 천천히 흘러내려 작은 시내로 모이며, 그리고는 큰 강이 되어 바다로 향한다. 또 어떤 물은 작은 시내에서 시작하여 천천히 사그라들어 사라지기도 한다. 이와 마찬가지로, 우리의 삶도 다양한 경험과 선택으로 이루어진 여정이다."},
          { id: 6, title: "보드7", manager:"박해찬" , priority: "low", start: "09/21/2023", end: "09/30/2023", description:"삶은 때로는 산처럼 고난과 어려움으로 가득할 수 있지만, 이를 극복하고 내리는 물처럼 계속해서 흘러가야 한다. 인생의 강을 헤쳐나가는 동안, 우리는 새로운 경험을 얻고 성장할 기회를 많이 마주하게 된다. 어떤 순간은 조용하고 고요하게 흘러가는 것처럼 보일지도 모르지만, 그 속에는 숨어 있는 강력한 힘이 있다."},
          { id: 7, title: "보드8", manager:"최송윤" , priority: "low", start: "10/21/2023", end: "10/30/2023", description:"물은 시간이 지남에 따라 모양을 바꾸며 다양한 모습을 보여준다. 우리의 삶도 그러하다. 우리는 성장하고 변화하며 새로운 목표와 꿈을 향해 나아간다. 때로는 우리의 흐름을 조절하고 새로운 방향으로 나아가야 할 때가 있을 것이다."},
          { id: 8, title: "보드9", manager:"최송윤" , priority: "low", start: "10/21/2023", end: "10/30/2023", description:"물은 언제나 순환한다. 비가 내리고 강이 넘치며 바닷물은 수증기로 올라가 하늘을 이루고, 다시 비로 내린다. 이러한 순환은 우리의 삶에서도 발견할 수 있다. 고난과 좋은 일, 성공과 실패는 계속해서 왔다 갔다 하며 우리를 돌아보게 하고 배우게 한다."},
          { id: 9, title: "보드10", manager:"qortlgus" , priority: "high", start: "10/21/2023", end: "10/30/2023", description:"인생의 여정은 어떤 물과도 같다. 각자의 고유한 흐름과 목적을 가지며, 어떤 순간은 평온하고 어떤 순간은 격렬하게 흘러간다. 그러나 중요한 것은 우리가 그 흐름을 받아들이고 삶의 다양한 경험을 통해 성장하고 발전하는 것이다. 물처럼 우리도 앞으로의 여정을 향해 끊임없이 흘러나가야 하며, 그 흐름을 즐기며 인생을 살아가야 한다."},
        ],
      },
      {
        title: "기획",
        id: 2,
        todos: [
          { id: 10, title: "보드11", manager:"박해찬" , priority: "high", start: "09/21/2023", end: "09/21/2023", description:"인공 지능은 인류 역사와 긴 밀접한 관련이 있는 분야 중 하나입니다. 이것은 컴퓨터 과학, 기계 학습, 데이터 과학 및 다른 다양한 분야의 연구와 협력을 통해 지속적으로 발전하고 있습니다."},
          { id: 11, title: "보드12", manager:"박해찬" , priority: "low", start: "09/21/2023", end: "09/30/2023", description:"인공 지능의 역사는 20세기 초반으로 거슬러 올라갑니다. 20세기 초기에는 컴퓨터 과학자들이 '기호 논리'와 같은 개념을 통해 사고를 모방하려는 시도를 했습니다. 이 시기에는 언어 처리와 추론에 대한 초기 모델들이 개발되었으며, 이러한 모델들은 규칙 기반 시스템으로 작동했습니다."},
          { id: 12, title: "보드13", manager:"백시현" , priority: "high", start: "10/21/2023", end: "10/30/2023", description:"그러나 인공 지능은 기계 학습의 등장과 함께 실질적인 발전을 이루어냈습니다. 1950년대와 1960년대에는 프랭크 로젠블랫, 앨런 튜링, 존 매카시 등의 연구자들이 컴퓨터 프로그램이 스스로 학습하고 패턴을 인식할 수 있는 방법을 개발하기 시작했습니다. 이러한 노력은 인공 신경망과 같은 모델의 초기 형태로 나타났으며, 이후 몇 십 년 동안 기계 학습 알고리즘의 발전에 큰 영향을 미쳤습니다."},
          { id: 13, title: "보드14", manager:"백시현" , priority: "high", start: "10/21/2023", end: "10/30/2023", description:"2000년대 이후로 인공 지능의 주요 발전은 딥 러닝이라고 하는 심층 신경망을 중심으로 진행되었습니다. 딥 러닝은 대규모 데이터 세트를 사용하여 복잡한 문제를 해결하는 데 효과적이며, 이미지 인식, 음성 인식, 자연어 처리 등 다양한 응용 분야에서 큰 성과를 거두었습니다. 이러한 성과는 GPU와 같은 고성능 하드웨어의 발전과 결합되어 발전의 속도를 더욱 가속화시켰습니다."},
          { id: 14, title: "보드15", manager:"박해찬" , priority: "low", start: "10/21/2023", end: "10/30/2023", description:"현재, 인공 지능은 우리 일상 생활의 많은 측면에 깊게 뿌리를 뒀습니다. 스마트폰의 음성 비서, 온라인 검색 엔진, 자율 주행 자동차, 의료 진단 및 치료 도구, 금융 예측 시스템, 그리고 물류 및 제조 프로세스의 최적화 등 여러 분야에서 인공 지능 기술이 활용되고 있습니다."},
          { id: 15, title: "보드15", manager:"박해찬" , priority: "low", start: "10/21/2023", end: "10/30/2023", description:"자연어 처리는 현재 인공 지능 분야에서 가장 빠르게 발전하고 있는 분야 중 하나입니다. 대규모 언어 모델과 사전 훈련된 모델, 예를 들어 GPT-3와 BERT,는 자연어 이해 및 생성 작업에서 높은 성능을 보이며, 기계 번역, 질문 응답 시스템, 콘텐츠 생성, 감정 분석 등의 응용 분야에서 활용되고 있습니다."},
          { id: 16, title: "보드15", manager:"박해찬" , priority: "mid", start: "10/21/2023", end: "10/30/2023", description:"자율 주행 자동차 기술은 또한 현재 많은 관심을 받고 있는 분야 중 하나입니다. 기업들은 센서, 컴퓨터 비전, 머신 러닝을 사용하여 자동차가 환경을 인식하고 안전하게 운전할 수 있도록 개발하고 있습니다. 자율 주행 기술은 교통 안전성과 효율성을 향상시키는 데 큰 잠재력이 있으며, 미래 도시에서는 표준이 될 것으로 예상됩니다."},
          { id: 17, title: "보드15", manager:"박해찬" , priority: "high", start: "10/21/2023", end: "10/30/2023", description:"인공 지능은 의료 분야에서도 혁신적인 역할을 하고 있습니다. 의료 이미지 분석, 질병 예측, 약물 개발, 환자 모니터링 등 다양한 응용 분야에서 인공 지능 시스템은 의료 전문가들을 지원하고 환자의 치료 결과를 개선하고 있습니다. 특히 COVID-19와 같은 긴급 상황에서는 인공 지능을 활용하여 진단 및 치료 방법을 빠르게 개발하는 데 도움이 되고 있습니다."},
          { id: 18, title: "보드15", manager:"박해찬" , priority: "low", start: "10/21/2023", end: "10/30/2023", description:"인공 지능은 미래에 더욱 더 중요한 역할을 할 것으로 예상됩니다. 몇 가지 주목할만한 미래 전망은 다음과 같습니다."},
        ],
      },
    ],
  },
  reducers: {
    boardsRedux: (state, action) => {
      console.log(state);
      state.boards = action.payload;
    },
  },
});
export default boardsSlice;
export const { boardsRedux } = boardsSlice.actions;
